In [2]:
import pandas as pd

In [3]:
price_mentions_data = pd.read_csv('../Data/mentions_price_by_day.csv')

In [4]:
price_mentions_data

,date,Unnamed: 1,Adj Close,Close,High,Low,Open,Volume,mentions
0,2020-12-08,AAL,17.629999,17.629999,17.920000,17.160000,17.469999,95855400.0,21.0
1,2020-12-08,AAPL,124.194412,124.379997,124.980003,123.089996,124.370003,82225500.0,88.0
2,2020-12-08,ALOT,11.680000,11.680000,11.740000,11.500000,11.520000,27100.0,4.0
3,2020-12-08,AMC,3.980000,3.980000,4.020000,3.610000,3.610000,29530600.0,11.0
4,2020-12-08,AMCX,31.070000,31.070000,32.139999,30.889999,31.280001,591300.0,0.0
...,...,...,...,...,...,...,...,...,...
4833,2021-02-04,TRHC,53.450001,53.450001,54.490002,52.770000,54.290001,331900.0,0.0
4834,2021-02-04,TRIT,6.920000,6.920000,7.160000,6.900000,7.150000,4005300.0,0.0
4835,2021-02-04,TSLA,849.989990,849.989990,856.500000,833.419983,855.000000,15812700.0,0.0
4836,2021-02-04,VXRT,9.050000,9.050000,10.500000,8.910000,9.940000,37896600.0,0.0
4837,2021-02-04,ZYXI,18.160000,18.160000,18.980000,17.910000,18.910000,559300.0,0.0

In [18]:

price_mentions_data.rename(columns={'Unnamed: 1':"Ticker"}, inplace=True)
# new_df = price_mentions_data.set_index('Ticker').sort_index().sort_values(by=['Ticker','date'])
new_df = price_mentions_data.set_index("date").sort_values(by=['Ticker','date'])
new_df['Volume'] = new_df['Volume'].fillna(value=0)
new_df = new_df.fillna(method='ffill')

In [19]:
new_df

,Ticker,Adj Close,Close,High,Low,Open,Volume,mentions
date,,,,,,,,
2020-12-08,AAL,17.629999,17.629999,17.920000,17.160000,17.469999,95855400.0,21.0
2020-12-09,AAL,17.160000,17.160000,18.629999,16.629999,18.370001,138508300.0,41.0
2020-12-10,AAL,17.990000,17.990000,18.040001,16.670000,16.750000,86395200.0,76.0
2020-12-11,AAL,17.049999,17.049999,17.910000,16.809999,17.820000,106957300.0,74.0
2020-12-12,AAL,17.049999,17.049999,17.910000,16.809999,17.820000,0.0,31.0
...,...,...,...,...,...,...,...,...
2021-01-31,ZYXI,18.070000,18.070000,20.219999,18.010000,19.830000,0.0,0.0
2021-02-01,ZYXI,18.170000,18.170000,18.750000,17.500000,18.600000,556800.0,1.0
2021-02-02,ZYXI,19.510000,19.510000,19.660000,18.049999,18.350000,734600.0,0.0
2021-02-03,ZYXI,18.709999,18.709999,19.639999,18.610001,19.540001,414900.0,0.0
2021-02-04,ZYXI,18.160000,18.160000,18.980000,17.910000,18.910000,559300.0,0.0

In [21]:
new_df.to_csv('../Data/price_mentions_dateindex.csv')

In [8]:
tickers = pd.read_csv("../Data/final_ticker_list.csv")

In [9]:
tickers

   Tickers
0      AMC
1     PUBM
2     GOGO
3     ISUN
4     CLVS
..     ...
77    TLRY
78     BRO
79    CRSR
80    IBKR
81     BIO

[82 rows x 1 columns]

In [10]:
tickers.to_json("../Data/tickerlist.json")

In [7]:
df3 = pd.read_json("../Data/price_mentions.json")
df3

,date,Ticker,Adj Close,Close,High,Low,Open,Volume,mentions
0,2020-12-08,AAL,17.629999,17.629999,17.920000,17.160000,17.469999,95855400,21
82,2020-12-09,AAL,17.160000,17.160000,18.629999,16.629999,18.370001,138508300,41
164,2020-12-10,AAL,17.990000,17.990000,18.040001,16.670000,16.750000,86395200,76
246,2020-12-11,AAL,17.049999,17.049999,17.910000,16.809999,17.820000,106957300,74
328,2020-12-12,AAL,17.049999,17.049999,17.910000,16.809999,17.820000,0,31
...,...,...,...,...,...,...,...,...,...
4509,2021-01-31,ZYXI,18.070000,18.070000,20.219999,18.010000,19.830000,0,0
4591,2021-02-01,ZYXI,18.170000,18.170000,18.750000,17.500000,18.600000,556800,1
4673,2021-02-02,ZYXI,19.510000,19.510000,19.660000,18.049999,18.350000,734600,0
4755,2021-02-03,ZYXI,18.709999,18.709999,19.639999,18.610001,19.540001,414900,0
4837,2021-02-04,ZYXI,18.160000,18.160000,18.980000,17.910000,18.910000,559300,0

In [8]:
df4 = pd.read_json("../Data/samples.json")
df4

,names,metadata,samples
0,940,"{'id': 940, 'ethnicity': 'Caucasian', 'gender'...","{'id': '940', 'otu_ids': [1167, 2859, 482, 226..."
1,941,"{'id': 941, 'ethnicity': 'Caucasian/Midleaster...","{'id': '941', 'otu_ids': [2722, 944, 2419, 253..."
2,943,"{'id': 943, 'ethnicity': 'Caucasian', 'gender'...","{'id': '943', 'otu_ids': [1795], 'sample_value..."
3,944,"{'id': 944, 'ethnicity': 'European', 'gender':...","{'id': '944', 'otu_ids': [922, 3555, 943, 1013..."
4,945,"{'id': 945, 'ethnicity': 'Caucasian', 'gender'...","{'id': '945', 'otu_ids': [944, 1795, 922, 2419..."
...,...,...,...
148,1574,"{'id': 1574, 'ethnicity': 'Caucasian', 'gender...","{'id': '1574', 'otu_ids': [482, 909, 2419, 944..."
149,1576,"{'id': 1576, 'ethnicity': 'Caucasian', 'gender...","{'id': '1576', 'otu_ids': [1929, 1770, 1926, 1..."
150,1577,"{'id': 1577, 'ethnicity': 'Caucasian', 'gender...","{'id': '1577', 'otu_ids': [922, 1795, 151, 318..."
151,1581,"{'id': 1581, 'ethnicity': 'Asian(American)', '...","{'id': '1581', 'otu_ids': [1795, 3312, 1399, 3..."
152,1601,"{'id': 1601, 'ethnicity': 'Caucasian', 'gender...","{'id': '1601', 'otu_ids': [1929, 3030, 1795, 8..."

In [22]:
d5 = pd.read_csv("../Data/price_mentions_dateindex.csv")
d5

,date,Ticker,Adj Close,Close,High,Low,Open,Volume,mentions
0,2020-12-08,AAL,17.629999,17.629999,17.920000,17.160000,17.469999,95855400.0,21.0
1,2020-12-09,AAL,17.160000,17.160000,18.629999,16.629999,18.370001,138508300.0,41.0
2,2020-12-10,AAL,17.990000,17.990000,18.040001,16.670000,16.750000,86395200.0,76.0
3,2020-12-11,AAL,17.049999,17.049999,17.910000,16.809999,17.820000,106957300.0,74.0
4,2020-12-12,AAL,17.049999,17.049999,17.910000,16.809999,17.820000,0.0,31.0
...,...,...,...,...,...,...,...,...,...
4833,2021-01-31,ZYXI,18.070000,18.070000,20.219999,18.010000,19.830000,0.0,0.0
4834,2021-02-01,ZYXI,18.170000,18.170000,18.750000,17.500000,18.600000,556800.0,1.0
4835,2021-02-02,ZYXI,19.510000,19.510000,19.660000,18.049999,18.350000,734600.0,0.0
4836,2021-02-03,ZYXI,18.709999,18.709999,19.639999,18.610001,19.540001,414900.0,0.0
4837,2021-02-04,ZYXI,18.160000,18.160000,18.980000,17.910000,18.910000,559300.0,0.0

In [9]:
df4.columns()

TypeError: 'Index' object is not callable

In [12]:
df4["metadata"]

0      {'id': 940, 'ethnicity': 'Caucasian', 'gender'...
1      {'id': 941, 'ethnicity': 'Caucasian/Midleaster...
2      {'id': 943, 'ethnicity': 'Caucasian', 'gender'...
3      {'id': 944, 'ethnicity': 'European', 'gender':...
4      {'id': 945, 'ethnicity': 'Caucasian', 'gender'...
                             ...
148    {'id': 1574, 'ethnicity': 'Caucasian', 'gender...
149    {'id': 1576, 'ethnicity': 'Caucasian', 'gender...
150    {'id': 1577, 'ethnicity': 'Caucasian', 'gender...
151    {'id': 1581, 'ethnicity': 'Asian(American)', '...
152    {'id': 1601, 'ethnicity': 'Caucasian', 'gender...
Name: metadata, Length: 153, dtype: object